// src/data/provinceLocations.js
export const provinceLocations = [
    { province: 'ນະຄອນຫລວງວຽງຈັນ',     city: 'ນະຄອນຫລວງວຽງຈັນ', center: [17.9757, 102.6331] },
    { province: 'ແຂວງອັດຕະປື',         city: 'ເມືອງສາມັກຄີໄຊ',     center: [14.8000, 106.8333] },
    { province: 'ແຂວງບໍ່ແກ້ວ',         city: 'ເມືອງຫ້ວຍຊາຍ',     center: [20.2667, 100.4167] },
    { province: 'ແຂວງບໍລິຄໍາໄຊ',     city: 'ເມືອງປາກຊັນ',     center: [18.3667, 103.6667] },
    { province: 'ແຂວງຈໍາປາສັກ',       city: 'ເມືອງປາກເຊ',       center: [15.1167, 105.8167] },
    { province: 'ແຂວງຫົວພັນ',         city: 'ເມືອງຊໍາເໜືອ',     center: [20.4167, 104.0500] },
    { province: 'ແຂວງຄໍາມ່ວນ',       city: 'ເມືອງທ່າແຂກ',     center: [17.4000, 104.8000] },
    { province: 'ແຂວງຫລວງນໍ້າທາ',     city: 'ເມືອງຫລວງນໍ້າທາ', center: [20.9500, 101.4000] },
    { province: 'ແຂວງຫລວງພະບາງ',     city: 'ເມືອງຫລວງພະບາງ', center: [19.8856, 102.1347] },
    { province: 'ແຂວງອຸດົມໄຊ',         city: 'ເມືອງໄຊ',         center: [20.6833, 101.9833] },
    { province: 'ແຂວງຜົ້ງສາລີ',       city: 'ເມືອງຜົ້ງສາລີ',   center: [21.6830, 101.9500] },
    { province: 'ແຂວງສາລະວັນ',       city: 'ເມືອງສາລະວັນ',   center: [15.7167, 106.4167] },
    { province: 'ແຂວງສະຫວັນນະເຂດ', city: 'ເມືອງໄກສອນພົມວິຫານ', center: [16.5667, 104.7500] },
    { province: 'ແຂວງເຊກອງ',         city: 'ເມືອງລະມາມ',     center: [15.3500, 106.7167] },
    { province: 'ແຂວງວຽງຈັນ',       city: 'ເມືອງໂພນໂຮງ',     center: [18.4937, 102.4103] },
    { province: 'ແຂວງໄຊຍະບູລີ',     city: 'ເມືອງໄຊຍະບູລີ', center: [19.2500, 101.7500] },
    { province: 'ແຂວງຊຽງຂວາງ',       city: 'ເມືອງໂພນສະຫວັນ', center: [19.4500, 103.1833] },
    { province: 'ແຂວງໄຊສົມບູນ',     city: 'ເມືອງອະນຸວົງ',   center: [18.9050, 103.1000] }
  ];
  export default provinceLocations